IDEA Open Model
DappedEndHaunchType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Type of haunch on dapped end
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum DappedEndHaunchType
Public Enumeration DappedEndHaunchType
Members
Member name | Value | Description
None | 0 |  No haunch
Left | 1 |  Left haunch
Right | 2 |  Right haunch
Both | 3 |  Both sides
See Also
Reference
IdeaRS.OpenModel.Detail Namespace